# IsValidSubelementReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..IsValidSubelementReference Method
Subelement Class See Also
---
Checks if given Reference identifies either a valid element or subelement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static bool IsValidSubelementReference(
	Document aDoc,
	Reference reference
)
```

Visual Basic
---
```text
Public Shared Function IsValidSubelementReference ( _
	aDoc As Document, _
	reference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidSubelementReference(
	Document^ aDoc,
	Reference^ reference
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The document.
reference
    Type: Autodesk.Revit.DB..::..Reference The reference that identifies an element or subelement.
# ### Return Value
True if %reference% identifies a valid element or subelement, false otherwise.
# Remarks
A reference to an element or subelement in a linked document is acceptable.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Subelement Class
Autodesk.Revit.DB Namespace